using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SafinaLearn.Cycles
{
    public static class Start
    {
        /// <summary>
        /// За каждый месяц банк начисляет к сумме вклада 7% от суммы. Напишите консольную программу, в которую пользователь вводит сумму вклада и количество месяцев. А банк вычисляет конечную сумму вклада с учетом начисления процентов за каждый месяц.
        /// Для вычисления суммы с учетом процентов используйте цикл for. Для ввода суммы вклада используйте выражение Convert.ToDecimal(Console.ReadLine()) (сумма вклада будет представлять тип decimal).
        /// </summary>
        public static void Task1()
        {
        }
        /// <summary>
        /// Перепишите предыдущую программу, только вместо цикла for используйте цикл while.
        /// </summary>
        public static void Task2()
        {
        }
        /// <summary>
        /// Напишите программу, которая выводит на консоль таблицу умножения
        /// </summary>
        public static void Task3()
        {
        }
        /// <summary>
        /// Напишите программу, в которую пользователь вводит два числа и выводит результат их умножения. При этом программа должны запрашивать у пользователя ввод чисел, пока оба вводимых числа не окажутся в диапазоне от 0 до 10. Если введенные числа окажутся больше 10 или меньше 0, то программа должна вывести пользователю о том, что введенные числа недопустимы, и повторно запросить у пользователя ввод двух чисел. Если введенные числа принадлежат диапазону от 0 до 10, то программа выводит результат умножения.
        ///Для организации ввода чисел используйте бесконечный цикл while и оператор break.
        /// </summary>
        public static void Task4()
        {
        }
    }
}
